const answerNum = document.querySelector(".answer-num");
const question = document.querySelector(".question");
const answer = document.querySelector(".input-answer");
const butCheck = document.querySelector(".but-check");
const isCorrect = document.querySelector(".isCorrect");
const nextBut = document.querySelector(".nextBut");

const quiz = [
    [
        ["Що таке зростання?", "кількісні зміни організму"],
        ["Що означає, що організм збільшився в розмірах?", "зростання"],
    ],
    [
        ["Що таке розвиток?", "якісні зміни організму"],
        ["Що означає, що організм змінився в структурі або функції?", "розвиток"],
    ],
    [
        ["Що таке вид з погляду систематики?", "найменша одиниця: вид"],
        ["Що таке найнижча одиниця систематики?", "вид"],
    ],
    [
        ["Яка будь-яка видова назва?", "Лісовий кіт"],
        ["Яке видове найменування лісового кота?", "Лісовий кіт"],
    ],
    [
        ["Яка запасаюча речовина у рослин?", "крохмаль"],
        ["Яка речовина запасається у рослинах?", "крохмаль"],
    ],
    [
        ["Яка запасаюча речовина у грибів і тварин?", "глікоген"],
        ["Яка речовина запасається у грибах і тваринах?", "глікоген"],
    ],
    [
        ["Для яких організмів характерні багатоядерні клітини?", "грибів"],
        ["Які організми мають багатоядерні клітини?", "гриби"],
    ],
    [
        ["З чого складається клітинна стінка у рослин?", "целюлози"],
        ["Яка речовина входить до складу клітинної стінки рослин?", "целюлоза"],
    ],
    [
        ["З чого складається клітинна стінка у грибів?", "хітину"],
        ["Яка речовина входить до складу клітинної стінки грибів?", "хітин"],
    ],
    [
        ["З чого складається клітинна стінка у бактерій?", "муреїну"],
        ["Яка речовина входить до складу клітинної стінки бактерій?", "муреїн"],
    ],
    [
        ["Що таке прокаріоти?", "організми у яких немає оформленого ядра або у ядра немає оболонки"],
        ["Які організми не мають оформленого ядра або у ядра немає оболонки?", "прокаріоти"],
    ],
    [
        ["Що таке еукаріоти?", "організми у яких є оформлене ядро або у ядра є оболонка"],
        ["Які організми мають оформлене ядро або у ядра є оболонка?", "еукаріоти"],
    ],
    [
        ["Що таке неклітинна форма життя?", "віруси"],
        ["Які форми життя не мають клітинної структури?", "віруси"],
    ],
    [
        ["Для яких організмів характерні великі вакуолі?", "рослин"],
        ["Які організми мають великі вакуолі?", "рослини"],
    ],
    [
        ["Перерахуйте двомембранні органели?", "ядро, мітохондрії, пластиди"],
        ["Які органели мають дві мембрани?", "ядро, мітохондрії, пластиди"],
    ],
    [
        ["Перерахуйте двумембранні органели рослин?", "пластиди: хлоропласти, лейкопласти, хромопласти"],
        ["Які органели мають дві мембрани і є в рослинах?", "пластиди: хлоропласти, лейкопласти, хромопласти"],
    ],
    [
        ["Які функції мітохондрій?", "синтез АТФ"],
        ["Що виробляють мітохондрії?", "АТФ"],
    ],
    [
        ["Перерахуйте одномембранні органели?", "ЕПС, апарат Гольджі, лізосоми"],
        ["Які органели мають одну мембрану?", "ЕПС, апарат Гольджі, лізосоми"],
    ],
    [
        ["У яких організмів відсутня клітинна стінка?", "тварин"],
        ["Які організми не мають клітинної стінки?", "тварини"],
    ],
    [
        ["Яка функція рибосом?", "синтез білків"],
        ["Що виробляють рибосоми?", "білки"],
    ],
    [
        ["Яка додаткова структура ядра?", "ядернця"],
        ["Яка структура є в ядрі?", "ядернця"],
    ],
    [
        ["Аеробні організми?", "використовують для дихання кисень"],
        ["Які організми використовують кисень для дихання?", "аеробні"],
    ],
    [
        ["Анаеробні організми?", "не використовують для дихання кисень"],
        ["Які організми не використовують кисень для дихання?", "анаеробні"],
    ],
    [
        ["Внутрішнє середовище і транспорт речовин в клітині клітини забезпечує?", "цитоплазма"],
        ["Яка структура забезпечує транспорт речовин в клітині?", "цитоплазма"],
    ],
];


let counter = 0;
let mark = 0;
let isCor = false;
let questionAndAnswers = [];
let attemptNum = 2;

function askQuestion() {
    isCor = false;
    isCorrect.innerHTML = `У вас осталось попыток: ${attemptNum}`;
    answerNum.innerHTML = `Вопрос номер ${counter + 1} / ${quiz.length} `;
    questionAndAnswers = quiz[counter][Math.round(Math.random() * (1 - 0) + 0)];
    question.innerHTML = questionAndAnswers[0];
}

butCheck.addEventListener("click", () => {
    if (attemptNum > 0 && !isCor) {
        attemptNum--;
        for (let j = 1; j < questionAndAnswers.length; j++) {
            if (answer.value === questionAndAnswers[j]) {
                isCor = true;
                mark++;
                break;
            }
            else {
                isCorrect.innerHTML = `Вопрос отвечен неправильно; Попробуйте еще, у вас осталось попыток: ${attemptNum}`;
            }
        }
    }
    if (isCor || attemptNum <= 0) {
        let answersAll = "";
        for (let k = 1; k < questionAndAnswers.length; k++) {
            k === questionAndAnswers.length - 1 ? answersAll += questionAndAnswers[k] + ";" : answersAll += questionAndAnswers[k] + ", ";
        }
        isCorrect.innerHTML = `Вопрос отвечено ${isCor ? "правильно" : "неправильно"}. Вот все варианты правильных ответов: ${answersAll}`;
        if (counter + 1 === quiz.length) {
            nextBut.innerHTML = "Закінчити";
        }
    }
});

nextBut.addEventListener("click", () => {
    if (attemptNum <= 0 || isCor) {
        counter++;
        isCor = false;
        attemptNum = 2;
        answer.value = "";
        if (counter < quiz.length) {
            askQuestion();
        } else {
            alert(`Вы ответили правильно на ${mark} / ${quiz.length} вопросов`);
            counter = 0;
            mark = 0;
            askQuestion();
        }
    }
});

askQuestion();